Updating Rows and Columns

https://www.youtube.com/watch?v=DCDe29sIKcE

In [1]:
people = {
    "first":["tugbay", "kathi", "leni"],
    "last":["atilla", "essmann", "essmann"],
    "email":["tugbayatilla@gmail.com", "katharina@essmann.de", "leni@essmann.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first     last                   email
0  tugbay   atilla  tugbayatilla@gmail.com
1   kathi  essmann    katharina@essmann.de
2    leni  essmann        leni@essmann.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
# change the column names first to firstname

df.columns = ['first_name','last_name', 'email']

In [7]:
df

  first_name last_name                   email
0     tugbay    atilla  tugbayatilla@gmail.com
1      kathi   essmann    katharina@essmann.de
2       leni   essmann        leni@essmann.com

In [8]:
# altering column names - uppercase all
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                   EMAIL
0     tugbay    atilla  tugbayatilla@gmail.com
1      kathi   essmann    katharina@essmann.de
2       leni   essmann        leni@essmann.com

In [10]:
# altering column names - replace spaces with underscores
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME                   EMAIL
0     tugbay    atilla  tugbayatilla@gmail.com
1      kathi   essmann    katharina@essmann.de
2       leni   essmann        leni@essmann.com

In [11]:
# lets back to normal
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                   email
0     tugbay    atilla  tugbayatilla@gmail.com
1      kathi   essmann    katharina@essmann.de
2       leni   essmann        leni@essmann.com

In [13]:
# changing specific column names
df.rename(columns={'first_name':'first', 'last_name':'last'}, inplace=True)

In [14]:
df

    first     last                   email
0  tugbay   atilla  tugbayatilla@gmail.com
1   kathi  essmann    katharina@essmann.de
2    leni  essmann        leni@essmann.com

In [18]:
# how to update single value
df.loc[2] = ['Leni', 'Eßmann', 'leni.essmann@google.de']

In [19]:
df

    first     last                   email
0  tugbay   atilla  tugbayatilla@gmail.com
1   kathi  essmann    katharina@essmann.de
2    Leni   Eßmann  leni.essmann@google.de

In [20]:
# what if change only 1 or 2 values
df.loc[2, ['first', 'last']] = ['leni', 'essmann']

In [21]:
df

    first     last                   email
0  tugbay   atilla  tugbayatilla@gmail.com
1   kathi  essmann    katharina@essmann.de
2    leni  essmann  leni.essmann@google.de

In [23]:
# change only 1 value

df.loc[2, 'first'] = 'Leni'

In [24]:
df

    first     last                   email
0  tugbay   atilla  tugbayatilla@gmail.com
1   kathi  essmann    katharina@essmann.de
2    Leni  essmann  leni.essmann@google.de

In [27]:
# another way to do that - if you are using single value, 'at' is suggested
df.at[2, 'first'] = 'Leni'

In [26]:
df

    first     last                   email
0  tugbay   atilla  tugbayatilla@gmail.com
1   kathi  essmann    katharina@essmann.de
2    Leni  essmann  leni.essmann@google.de

In [28]:
# WARNING - common mistake
filt = df['email'] == 'katharina@essmann.de'
df[filt]

   first     last                 email
1  kathi  essmann  katharina@essmann.de

In [29]:
# to get the value
df[filt]['last']

1    essmann
Name: last, dtype: object

In [30]:
# getting the WARNING here - A value is trying to be set on a copy of a slice from a DataFrame.
df[filt]['last'] = 'Atilla'

/var/folders/61/w6wm6pz9409b1gwly3wry3dh0000gn/T/ipykernel_800/3132207310.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Atilla'

In [31]:
df.loc[filt, 'last'] = 'Atilla'

In [32]:
df

    first     last                   email
0  tugbay   atilla  tugbayatilla@gmail.com
1   kathi   Atilla    katharina@essmann.de
2    Leni  essmann  leni.essmann@google.de

In [33]:
# to see the values as lower for all
df['email'].str.lower()

0    tugbayatilla@gmail.com
1      katharina@essmann.de
2    leni.essmann@google.de
Name: email, dtype: object

In [34]:
# to change the values as lower for all
df['email'] = df['email'].str.lower()

In [35]:
df

    first     last                   email
0  tugbay   atilla  tugbayatilla@gmail.com
1   kathi   Atilla    katharina@essmann.de
2    Leni  essmann  leni.essmann@google.de

In [36]:
# doing the same thing but creates confusion

# apply
# map
# applymap
# replace

In [37]:
# apply to Series
# applying the functions to the series
df['email'].apply(len)

0    22
1    20
2    22
Name: email, dtype: int64

In [38]:
# create custom function and update values in series
def update_email(email):
    return email.upper()

In [39]:
# only visualise
df['email'].apply(update_email)

0    TUGBAYATILLA@GMAIL.COM
1      KATHARINA@ESSMANN.DE
2    LENI.ESSMANN@GOOGLE.DE
Name: email, dtype: object

In [40]:
# to apply function
df['email'] = df['email'].apply(update_email)

In [41]:
df

    first     last                   email
0  tugbay   atilla  TUGBAYATILLA@GMAIL.COM
1   kathi   Atilla    KATHARINA@ESSMANN.DE
2    Leni  essmann  LENI.ESSMANN@GOOGLE.DE

In [42]:
# using lambda function to make lower again
df['email'] = df['email'].apply(lambda x: x.lower())

In [43]:
df

    first     last                   email
0  tugbay   atilla  tugbayatilla@gmail.com
1   kathi   Atilla    katharina@essmann.de
2    Leni  essmann  leni.essmann@google.de

In [44]:
# how to apply for DataFrames
# apply to each series not data in Series
# so number of rows and columns
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [49]:
len(df['email'])

3

In [50]:
# every row has howmany values
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [52]:
# get min len data from the series
df.apply(pd.Series.min)

first                    Leni
last                   Atilla
email    katharina@essmann.de
dtype: object

In [53]:
# x will be the Series in here
df.apply(lambda x: x.min())

first                    Leni
last                   Atilla
email    katharina@essmann.de
dtype: object

In [54]:
# apply every value in dataframe
df.applymap(len)

   first  last  email
0      6     6     22
1      5     6     20
2      4     7     22

In [55]:
# to change all to lower in dataframe
df.applymap(str.lower)

    first     last                   email
0  tugbay   atilla  tugbayatilla@gmail.com
1   kathi   atilla    katharina@essmann.de
2    leni  essmann  leni.essmann@google.de

In [58]:
# map function only work in series
df['first'].map({'tugbay':'tubi', 'kathi':'katharina'})

0         tubi
1    katharina
2          NaN
Name: first, dtype: object

In [59]:
# repalce and keep the rest of the data
df['first'].replace({'tugbay':'tubi', 'kathi':'katharina'})

0         tubi
1    katharina
2         Leni
Name: first, dtype: object